/**
 * @author: lulu
 * @date:
 * @desc: 前端静态菜单项
 */
const summarizeNav = [{
  title: '从事前端行业一年的总结',
  key: '1'
}]
const summarizeContent = [{
  key: '1',
  content: `
          <h2>从事前端行业一年的总结</h2>
          <div>
            <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            到目前为止，从事前端开发已经一年了。回想起从刚进公司的小白到现在能够逐渐了解前端工程化、需求原型了解与设计、开发规范、团队协作各阶段
            的原理与重要事项。深知还有很多不足，对待项目考虑的不合理，在接下来的规划中重点是对项目的需求、用户交互、浏览器兼容、系统的性能与维护
            进行磨练。
            </p>
            <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            刚接触HCF数据库管理平台时，我每天想的最多的是<strong>为什么？？</strong>，导师来了一句<strong>这就是经验</strong>。
            当时的我只说了一句，<strong>嗯！现在努力吧！！</strong>，刚开始自己不会写组件，写逻辑代码，每天看别人的项目，真的是一脸懵。我不明白
            同样的效果，为何要用这一种方式。我记得最清楚的是：为何要写这些组件（components），而且是组件套组件，后来去github、stackOverflow看了
            一些别人总结的经验和同事那里获取的经验，才知道现在的前端不仅仅是界面展示，而是组件化、模块化、按需加载...
            </p>
            <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            当接触到项目第一个功能（业务管理、应用管理、实例管理），因为我们的项目是针对的后台的企业级管理平台，而且涉及的是数据库相关的东西，对于业务确实比较难理解。当时
            我请教了项目经理，想弄明白为何要做这些，相互关系是什么。其实<i>一个业务对应多个应用，一个应用对应多个实例...</i>
            对于界面的风格设计比较简单（后台系统），编程语法风格：Airbnb，语法规范：eslint，以及工程目录的设计都搞懂了之后，开始我的第一个编程之路。
            </p>
            <img src="./static/img/cmb.jpg"/ >
            <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            回顾：当金色钥匙开启了我的第一个编程之路时，就真的是一名程序猿，我热爱我的行业，我的程序。所以我会一直坚持下去。
            因为我当时是3月份入职，而5月份团队百分之八十的人都离职了，连我的导师也走了。说实话当时我有点慌，慌的不是也要跟着走，而是以后假如遇到不懂的
            应该怎么办，虽然平时自己也会去相关的社区找答案，但确实要花费大量的时间，而且那时候我算是项目的主力了，差不多大部分功能我都有了解及参与开发。
            冷静一下细想，<strong>靠人不如靠己</strong>。所以从这开始平时我会自己看一些教程零基础搭建一些项目(demo)，把平时遇到比较坑的问题及解决大致
            写到印象笔记。后来也经常去参加公司组织的<strong>前端技术分享会</strong>，提升一下自己，顺便认识下大佬。期间自己无数次零基础搭建react
            全家桶，零基础搭建vue全家桶，虽然利用webpack构建的那些简单功能不值得一提，但总能收获到一些自己意想不到的东西。
            </p>
             <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            到现在为止，对前端这个行业及相关技术栈有一定有了解，也从一些小项目中收获了不了。入行容易，那是因为对现在的技术更新有一定的局限性；深造难，
            因为前端这个行业发展太快了，实在跟不上时代的步伐。但最主要入门技术还是要有:react+ant design+redux+webpack、react+dva+ant design+webpack、
            vue+element ui+vuex+vue-router、es6（语法）、webpack构建、Git项目管理(工作流gitflow)、node模块(node_modules)、
            nodeJs(未来发展趋势)，对这些有一定的了解，结合到项目中，多写案例，加油吧。
            </p>
          </div>
       
          `
}]
export {
  summarizeNav,
  summarizeContent
}
